vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/tsens.h
/*
 * Component description for TSENS
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-06-24T07:32:57Z  */
#ifndef _SAMC21_TSENS_COMPONENT_H_
#define _SAMC21_TSENS_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR TSENS                      */
/* ************************************************************************** */

/* -------- TSENS_CTRLA : (TSENS Offset: 0x00) (R/W 8) Control A Register -------- */
#define TSENS_CTRLA_RESETVALUE                _UINT8_(0x00)                                        /*  (TSENS_CTRLA) Control A Register  Reset Value */

#define TSENS_CTRLA_SWRST_Pos                 _UINT8_(0)                                           /* (TSENS_CTRLA) Software Reset Position */
#define TSENS_CTRLA_SWRST_Msk                 (_UINT8_(0x1) << TSENS_CTRLA_SWRST_Pos)              /* (TSENS_CTRLA) Software Reset Mask */
#define TSENS_CTRLA_SWRST(value)              (TSENS_CTRLA_SWRST_Msk & (_UINT8_(value) << TSENS_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the TSENS_CTRLA register */
#define TSENS_CTRLA_ENABLE_Pos                _UINT8_(1)                                           /* (TSENS_CTRLA) Enable Position */
#define TSENS_CTRLA_ENABLE_Msk                (_UINT8_(0x1) << TSENS_CTRLA_ENABLE_Pos)             /* (TSENS_CTRLA) Enable Mask */
#define TSENS_CTRLA_ENABLE(value)             (TSENS_CTRLA_ENABLE_Msk & (_UINT8_(value) << TSENS_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the TSENS_CTRLA register */
#define TSENS_CTRLA_RUNSTDBY_Pos              _UINT8_(6)                                           /* (TSENS_CTRLA) Run in Standby Position */
#define TSENS_CTRLA_RUNSTDBY_Msk              (_UINT8_(0x1) << TSENS_CTRLA_RUNSTDBY_Pos)           /* (TSENS_CTRLA) Run in Standby Mask */
#define TSENS_CTRLA_RUNSTDBY(value)           (TSENS_CTRLA_RUNSTDBY_Msk & (_UINT8_(value) << TSENS_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the TSENS_CTRLA register */
#define TSENS_CTRLA_Msk                       _UINT8_(0x43)                                        /* (TSENS_CTRLA) Register Mask  */


/* -------- TSENS_CTRLB : (TSENS Offset: 0x01) ( /W 8) Control B Register -------- */
#define TSENS_CTRLB_RESETVALUE                _UINT8_(0x00)                                        /*  (TSENS_CTRLB) Control B Register  Reset Value */

#define TSENS_CTRLB_START_Pos                 _UINT8_(0)                                           /* (TSENS_CTRLB) Start Measurement Position */
#define TSENS_CTRLB_START_Msk                 (_UINT8_(0x1) << TSENS_CTRLB_START_Pos)              /* (TSENS_CTRLB) Start Measurement Mask */
#define TSENS_CTRLB_START(value)              (TSENS_CTRLB_START_Msk & (_UINT8_(value) << TSENS_CTRLB_START_Pos)) /* Assignment of value for START in the TSENS_CTRLB register */
#define TSENS_CTRLB_Msk                       _UINT8_(0x01)                                        /* (TSENS_CTRLB) Register Mask  */


/* -------- TSENS_CTRLC : (TSENS Offset: 0x02) (R/W 8) Control C Register -------- */
#define TSENS_CTRLC_RESETVALUE                _UINT8_(0x00)                                        /*  (TSENS_CTRLC) Control C Register  Reset Value */

#define TSENS_CTRLC_WINMODE_Pos               _UINT8_(0)                                           /* (TSENS_CTRLC) Window Monitor Mode Position */
#define TSENS_CTRLC_WINMODE_Msk               (_UINT8_(0x7) << TSENS_CTRLC_WINMODE_Pos)            /* (TSENS_CTRLC) Window Monitor Mode Mask */
#define TSENS_CTRLC_WINMODE(value)            (TSENS_CTRLC_WINMODE_Msk & (_UINT8_(value) << TSENS_CTRLC_WINMODE_Pos)) /* Assignment of value for WINMODE in the TSENS_CTRLC register */
#define   TSENS_CTRLC_WINMODE_DISABLE_Val     _UINT8_(0x0)                                         /* (TSENS_CTRLC) No window mode (default)  */
#define   TSENS_CTRLC_WINMODE_ABOVE_Val       _UINT8_(0x1)                                         /* (TSENS_CTRLC) VALUE greater than WINLT  */
#define   TSENS_CTRLC_WINMODE_BELOW_Val       _UINT8_(0x2)                                         /* (TSENS_CTRLC) VALUE less than WINUT  */
#define   TSENS_CTRLC_WINMODE_INSIDE_Val      _UINT8_(0x3)                                         /* (TSENS_CTRLC) VALUE greater than WINLT and VALUE less than WINUT  */
#define   TSENS_CTRLC_WINMODE_OUTSIDE_Val     _UINT8_(0x4)                                         /* (TSENS_CTRLC) VALUE less than WINLT or VALUE greater than WINUT  */
#define   TSENS_CTRLC_WINMODE_HYST_ABOVE_Val  _UINT8_(0x5)                                         /* (TSENS_CTRLC) VALUE greater than WINUT with hysteresis to WINLT  */
#define   TSENS_CTRLC_WINMODE_HYST_BELOW_Val  _UINT8_(0x6)                                         /* (TSENS_CTRLC) VALUE less than WINLST with hysteresis to WINUT  */
#define TSENS_CTRLC_WINMODE_DISABLE           (TSENS_CTRLC_WINMODE_DISABLE_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) No window mode (default) Position */
#define TSENS_CTRLC_WINMODE_ABOVE             (TSENS_CTRLC_WINMODE_ABOVE_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) VALUE greater than WINLT Position */
#define TSENS_CTRLC_WINMODE_BELOW             (TSENS_CTRLC_WINMODE_BELOW_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) VALUE less than WINUT Position */
#define TSENS_CTRLC_WINMODE_INSIDE            (TSENS_CTRLC_WINMODE_INSIDE_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) VALUE greater than WINLT and VALUE less than WINUT Position */
#define TSENS_CTRLC_WINMODE_OUTSIDE           (TSENS_CTRLC_WINMODE_OUTSIDE_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) VALUE less than WINLT or VALUE greater than WINUT Position */
#define TSENS_CTRLC_WINMODE_HYST_ABOVE        (TSENS_CTRLC_WINMODE_HYST_ABOVE_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) VALUE greater than WINUT with hysteresis to WINLT Position */
#define TSENS_CTRLC_WINMODE_HYST_BELOW        (TSENS_CTRLC_WINMODE_HYST_BELOW_Val << TSENS_CTRLC_WINMODE_Pos) /* (TSENS_CTRLC) VALUE less than WINLST with hysteresis to WINUT Position */
#define TSENS_CTRLC_FREERUN_Pos               _UINT8_(4)                                           /* (TSENS_CTRLC) Free Running Measurement Position */
#define TSENS_CTRLC_FREERUN_Msk               (_UINT8_(0x1) << TSENS_CTRLC_FREERUN_Pos)            /* (TSENS_CTRLC) Free Running Measurement Mask */
#define TSENS_CTRLC_FREERUN(value)            (TSENS_CTRLC_FREERUN_Msk & (_UINT8_(value) << TSENS_CTRLC_FREERUN_Pos)) /* Assignment of value for FREERUN in the TSENS_CTRLC register */
#define TSENS_CTRLC_Msk                       _UINT8_(0x17)                                        /* (TSENS_CTRLC) Register Mask  */


/* -------- TSENS_EVCTRL : (TSENS Offset: 0x03) (R/W 8) Event Control Register -------- */
#define TSENS_EVCTRL_RESETVALUE               _UINT8_(0x00)                                        /*  (TSENS_EVCTRL) Event Control Register  Reset Value */

#define TSENS_EVCTRL_STARTEI_Pos              _UINT8_(0)                                           /* (TSENS_EVCTRL) Start Conversion Event Input Enable Position */
#define TSENS_EVCTRL_STARTEI_Msk              (_UINT8_(0x1) << TSENS_EVCTRL_STARTEI_Pos)           /* (TSENS_EVCTRL) Start Conversion Event Input Enable Mask */
#define TSENS_EVCTRL_STARTEI(value)           (TSENS_EVCTRL_STARTEI_Msk & (_UINT8_(value) << TSENS_EVCTRL_STARTEI_Pos)) /* Assignment of value for STARTEI in the TSENS_EVCTRL register */
#define TSENS_EVCTRL_STARTINV_Pos             _UINT8_(1)                                           /* (TSENS_EVCTRL) Start Conversion Event Invert Enable Position */
#define TSENS_EVCTRL_STARTINV_Msk             (_UINT8_(0x1) << TSENS_EVCTRL_STARTINV_Pos)          /* (TSENS_EVCTRL) Start Conversion Event Invert Enable Mask */
#define TSENS_EVCTRL_STARTINV(value)          (TSENS_EVCTRL_STARTINV_Msk & (_UINT8_(value) << TSENS_EVCTRL_STARTINV_Pos)) /* Assignment of value for STARTINV in the TSENS_EVCTRL register */
#define TSENS_EVCTRL_WINEO_Pos                _UINT8_(2)                                           /* (TSENS_EVCTRL) Window Monitor Event Out Position */
#define TSENS_EVCTRL_WINEO_Msk                (_UINT8_(0x1) << TSENS_EVCTRL_WINEO_Pos)             /* (TSENS_EVCTRL) Window Monitor Event Out Mask */
#define TSENS_EVCTRL_WINEO(value)             (TSENS_EVCTRL_WINEO_Msk & (_UINT8_(value) << TSENS_EVCTRL_WINEO_Pos)) /* Assignment of value for WINEO in the TSENS_EVCTRL register */
#define TSENS_EVCTRL_Msk                      _UINT8_(0x07)                                        /* (TSENS_EVCTRL) Register Mask  */


/* -------- TSENS_INTENCLR : (TSENS Offset: 0x04) (R/W 8) Interrupt Enable Clear Register -------- */
#define TSENS_INTENCLR_RESETVALUE             _UINT8_(0x00)                                        /*  (TSENS_INTENCLR) Interrupt Enable Clear Register  Reset Value */

