vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/tsens.h
#define TSENS_INTENCLR_RESRDY_Pos             _UINT8_(0)                                           /* (TSENS_INTENCLR) Result Ready Interrupt Enable Position */
#define TSENS_INTENCLR_RESRDY_Msk             (_UINT8_(0x1) << TSENS_INTENCLR_RESRDY_Pos)          /* (TSENS_INTENCLR) Result Ready Interrupt Enable Mask */
#define TSENS_INTENCLR_RESRDY(value)          (TSENS_INTENCLR_RESRDY_Msk & (_UINT8_(value) << TSENS_INTENCLR_RESRDY_Pos)) /* Assignment of value for RESRDY in the TSENS_INTENCLR register */
#define TSENS_INTENCLR_OVERRUN_Pos            _UINT8_(1)                                           /* (TSENS_INTENCLR) Overrun Interrupt Enable Position */
#define TSENS_INTENCLR_OVERRUN_Msk            (_UINT8_(0x1) << TSENS_INTENCLR_OVERRUN_Pos)         /* (TSENS_INTENCLR) Overrun Interrupt Enable Mask */
#define TSENS_INTENCLR_OVERRUN(value)         (TSENS_INTENCLR_OVERRUN_Msk & (_UINT8_(value) << TSENS_INTENCLR_OVERRUN_Pos)) /* Assignment of value for OVERRUN in the TSENS_INTENCLR register */
#define TSENS_INTENCLR_WINMON_Pos             _UINT8_(2)                                           /* (TSENS_INTENCLR) Window Monitor Interrupt Enable Position */
#define TSENS_INTENCLR_WINMON_Msk             (_UINT8_(0x1) << TSENS_INTENCLR_WINMON_Pos)          /* (TSENS_INTENCLR) Window Monitor Interrupt Enable Mask */
#define TSENS_INTENCLR_WINMON(value)          (TSENS_INTENCLR_WINMON_Msk & (_UINT8_(value) << TSENS_INTENCLR_WINMON_Pos)) /* Assignment of value for WINMON in the TSENS_INTENCLR register */
#define TSENS_INTENCLR_OVF_Pos                _UINT8_(3)                                           /* (TSENS_INTENCLR) Overflow Interrupt Enable Position */
#define TSENS_INTENCLR_OVF_Msk                (_UINT8_(0x1) << TSENS_INTENCLR_OVF_Pos)             /* (TSENS_INTENCLR) Overflow Interrupt Enable Mask */
#define TSENS_INTENCLR_OVF(value)             (TSENS_INTENCLR_OVF_Msk & (_UINT8_(value) << TSENS_INTENCLR_OVF_Pos)) /* Assignment of value for OVF in the TSENS_INTENCLR register */
#define TSENS_INTENCLR_Msk                    _UINT8_(0x0F)                                        /* (TSENS_INTENCLR) Register Mask  */


/* -------- TSENS_INTENSET : (TSENS Offset: 0x05) (R/W 8) Interrupt Enable Set Register -------- */
#define TSENS_INTENSET_RESETVALUE             _UINT8_(0x00)                                        /*  (TSENS_INTENSET) Interrupt Enable Set Register  Reset Value */

#define TSENS_INTENSET_RESRDY_Pos             _UINT8_(0)                                           /* (TSENS_INTENSET) Result Ready Interrupt Enable Position */
#define TSENS_INTENSET_RESRDY_Msk             (_UINT8_(0x1) << TSENS_INTENSET_RESRDY_Pos)          /* (TSENS_INTENSET) Result Ready Interrupt Enable Mask */
#define TSENS_INTENSET_RESRDY(value)          (TSENS_INTENSET_RESRDY_Msk & (_UINT8_(value) << TSENS_INTENSET_RESRDY_Pos)) /* Assignment of value for RESRDY in the TSENS_INTENSET register */
#define TSENS_INTENSET_OVERRUN_Pos            _UINT8_(1)                                           /* (TSENS_INTENSET) Overrun Interrupt Enable Position */
#define TSENS_INTENSET_OVERRUN_Msk            (_UINT8_(0x1) << TSENS_INTENSET_OVERRUN_Pos)         /* (TSENS_INTENSET) Overrun Interrupt Enable Mask */
#define TSENS_INTENSET_OVERRUN(value)         (TSENS_INTENSET_OVERRUN_Msk & (_UINT8_(value) << TSENS_INTENSET_OVERRUN_Pos)) /* Assignment of value for OVERRUN in the TSENS_INTENSET register */
#define TSENS_INTENSET_WINMON_Pos             _UINT8_(2)                                           /* (TSENS_INTENSET) Window Monitor Interrupt Enable Position */
#define TSENS_INTENSET_WINMON_Msk             (_UINT8_(0x1) << TSENS_INTENSET_WINMON_Pos)          /* (TSENS_INTENSET) Window Monitor Interrupt Enable Mask */
#define TSENS_INTENSET_WINMON(value)          (TSENS_INTENSET_WINMON_Msk & (_UINT8_(value) << TSENS_INTENSET_WINMON_Pos)) /* Assignment of value for WINMON in the TSENS_INTENSET register */
#define TSENS_INTENSET_OVF_Pos                _UINT8_(3)                                           /* (TSENS_INTENSET) Overflow Interrupt Enable Position */
#define TSENS_INTENSET_OVF_Msk                (_UINT8_(0x1) << TSENS_INTENSET_OVF_Pos)             /* (TSENS_INTENSET) Overflow Interrupt Enable Mask */
#define TSENS_INTENSET_OVF(value)             (TSENS_INTENSET_OVF_Msk & (_UINT8_(value) << TSENS_INTENSET_OVF_Pos)) /* Assignment of value for OVF in the TSENS_INTENSET register */
#define TSENS_INTENSET_Msk                    _UINT8_(0x0F)                                        /* (TSENS_INTENSET) Register Mask  */


/* -------- TSENS_INTFLAG : (TSENS Offset: 0x06) (R/W 8) Interrupt Flag Status and Clear Register -------- */
#define TSENS_INTFLAG_RESETVALUE              _UINT8_(0x00)                                        /*  (TSENS_INTFLAG) Interrupt Flag Status and Clear Register  Reset Value */

#define TSENS_INTFLAG_RESRDY_Pos              _UINT8_(0)                                           /* (TSENS_INTFLAG) Result Ready Position */
#define TSENS_INTFLAG_RESRDY_Msk              (_UINT8_(0x1) << TSENS_INTFLAG_RESRDY_Pos)           /* (TSENS_INTFLAG) Result Ready Mask */
#define TSENS_INTFLAG_RESRDY(value)           (TSENS_INTFLAG_RESRDY_Msk & (_UINT8_(value) << TSENS_INTFLAG_RESRDY_Pos)) /* Assignment of value for RESRDY in the TSENS_INTFLAG register */
#define TSENS_INTFLAG_OVERRUN_Pos             _UINT8_(1)                                           /* (TSENS_INTFLAG) Overrun Position */
#define TSENS_INTFLAG_OVERRUN_Msk             (_UINT8_(0x1) << TSENS_INTFLAG_OVERRUN_Pos)          /* (TSENS_INTFLAG) Overrun Mask */
#define TSENS_INTFLAG_OVERRUN(value)          (TSENS_INTFLAG_OVERRUN_Msk & (_UINT8_(value) << TSENS_INTFLAG_OVERRUN_Pos)) /* Assignment of value for OVERRUN in the TSENS_INTFLAG register */
#define TSENS_INTFLAG_WINMON_Pos              _UINT8_(2)                                           /* (TSENS_INTFLAG) Window Monitor Position */
#define TSENS_INTFLAG_WINMON_Msk              (_UINT8_(0x1) << TSENS_INTFLAG_WINMON_Pos)           /* (TSENS_INTFLAG) Window Monitor Mask */
#define TSENS_INTFLAG_WINMON(value)           (TSENS_INTFLAG_WINMON_Msk & (_UINT8_(value) << TSENS_INTFLAG_WINMON_Pos)) /* Assignment of value for WINMON in the TSENS_INTFLAG register */
#define TSENS_INTFLAG_OVF_Pos                 _UINT8_(3)                                           /* (TSENS_INTFLAG) Overflow Position */
#define TSENS_INTFLAG_OVF_Msk                 (_UINT8_(0x1) << TSENS_INTFLAG_OVF_Pos)              /* (TSENS_INTFLAG) Overflow Mask */
#define TSENS_INTFLAG_OVF(value)              (TSENS_INTFLAG_OVF_Msk & (_UINT8_(value) << TSENS_INTFLAG_OVF_Pos)) /* Assignment of value for OVF in the TSENS_INTFLAG register */
#define TSENS_INTFLAG_Msk                     _UINT8_(0x0F)                                        /* (TSENS_INTFLAG) Register Mask  */


/* -------- TSENS_STATUS : (TSENS Offset: 0x07) ( R/ 8) Status Register -------- */
#define TSENS_STATUS_RESETVALUE               _UINT8_(0x00)                                        /*  (TSENS_STATUS) Status Register  Reset Value */

#define TSENS_STATUS_OVF_Pos                  _UINT8_(0)                                           /* (TSENS_STATUS) Result Overflow Position */
#define TSENS_STATUS_OVF_Msk                  (_UINT8_(0x1) << TSENS_STATUS_OVF_Pos)               /* (TSENS_STATUS) Result Overflow Mask */
#define TSENS_STATUS_OVF(value)               (TSENS_STATUS_OVF_Msk & (_UINT8_(value) << TSENS_STATUS_OVF_Pos)) /* Assignment of value for OVF in the TSENS_STATUS register */
#define TSENS_STATUS_Msk                      _UINT8_(0x01)                                        /* (TSENS_STATUS) Register Mask  */


/* -------- TSENS_SYNCBUSY : (TSENS Offset: 0x08) ( R/ 32) Synchronization Busy Register -------- */
#define TSENS_SYNCBUSY_RESETVALUE             _UINT32_(0x00)                                       /*  (TSENS_SYNCBUSY) Synchronization Busy Register  Reset Value */

#define TSENS_SYNCBUSY_SWRST_Pos              _UINT32_(0)                                          /* (TSENS_SYNCBUSY) Software Reset Busy Position */
#define TSENS_SYNCBUSY_SWRST_Msk              (_UINT32_(0x1) << TSENS_SYNCBUSY_SWRST_Pos)          /* (TSENS_SYNCBUSY) Software Reset Busy Mask */
#define TSENS_SYNCBUSY_SWRST(value)           (TSENS_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << TSENS_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the TSENS_SYNCBUSY register */
#define TSENS_SYNCBUSY_ENABLE_Pos             _UINT32_(1)                                          /* (TSENS_SYNCBUSY) Enable Busy Position */
#define TSENS_SYNCBUSY_ENABLE_Msk             (_UINT32_(0x1) << TSENS_SYNCBUSY_ENABLE_Pos)         /* (TSENS_SYNCBUSY) Enable Busy Mask */
#define TSENS_SYNCBUSY_ENABLE(value)          (TSENS_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << TSENS_SYNCBUSY_ENABLE_Pos)) /* Assignment of value for ENABLE in the TSENS_SYNCBUSY register */
#define TSENS_SYNCBUSY_Msk                    _UINT32_(0x00000003)                                 /* (TSENS_SYNCBUSY) Register Mask  */


