vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/tsens.h
/* -------- TSENS_VALUE : (TSENS Offset: 0x0C) ( R/ 32) Value Register -------- */
#define TSENS_VALUE_RESETVALUE                _UINT32_(0x00)                                       /*  (TSENS_VALUE) Value Register  Reset Value */

#define TSENS_VALUE_VALUE_Pos                 _UINT32_(0)                                          /* (TSENS_VALUE) Measurement Value Position */
#define TSENS_VALUE_VALUE_Msk                 (_UINT32_(0xFFFFFF) << TSENS_VALUE_VALUE_Pos)        /* (TSENS_VALUE) Measurement Value Mask */
#define TSENS_VALUE_VALUE(value)              (TSENS_VALUE_VALUE_Msk & (_UINT32_(value) << TSENS_VALUE_VALUE_Pos)) /* Assignment of value for VALUE in the TSENS_VALUE register */
#define TSENS_VALUE_Msk                       _UINT32_(0x00FFFFFF)                                 /* (TSENS_VALUE) Register Mask  */


/* -------- TSENS_WINLT : (TSENS Offset: 0x10) (R/W 32) Window Monitor Lower Threshold Register -------- */
#define TSENS_WINLT_RESETVALUE                _UINT32_(0x00)                                       /*  (TSENS_WINLT) Window Monitor Lower Threshold Register  Reset Value */

#define TSENS_WINLT_WINLT_Pos                 _UINT32_(0)                                          /* (TSENS_WINLT) Window Lower Threshold Position */
#define TSENS_WINLT_WINLT_Msk                 (_UINT32_(0xFFFFFF) << TSENS_WINLT_WINLT_Pos)        /* (TSENS_WINLT) Window Lower Threshold Mask */
#define TSENS_WINLT_WINLT(value)              (TSENS_WINLT_WINLT_Msk & (_UINT32_(value) << TSENS_WINLT_WINLT_Pos)) /* Assignment of value for WINLT in the TSENS_WINLT register */
#define TSENS_WINLT_Msk                       _UINT32_(0x00FFFFFF)                                 /* (TSENS_WINLT) Register Mask  */


/* -------- TSENS_WINUT : (TSENS Offset: 0x14) (R/W 32) Window Monitor Upper Threshold Register -------- */
#define TSENS_WINUT_RESETVALUE                _UINT32_(0x00)                                       /*  (TSENS_WINUT) Window Monitor Upper Threshold Register  Reset Value */

#define TSENS_WINUT_WINUT_Pos                 _UINT32_(0)                                          /* (TSENS_WINUT) Window Upper Threshold Position */
#define TSENS_WINUT_WINUT_Msk                 (_UINT32_(0xFFFFFF) << TSENS_WINUT_WINUT_Pos)        /* (TSENS_WINUT) Window Upper Threshold Mask */
#define TSENS_WINUT_WINUT(value)              (TSENS_WINUT_WINUT_Msk & (_UINT32_(value) << TSENS_WINUT_WINUT_Pos)) /* Assignment of value for WINUT in the TSENS_WINUT register */
#define TSENS_WINUT_Msk                       _UINT32_(0x00FFFFFF)                                 /* (TSENS_WINUT) Register Mask  */


/* -------- TSENS_GAIN : (TSENS Offset: 0x18) (R/W 32) Gain Register -------- */
#define TSENS_GAIN_RESETVALUE                 _UINT32_(0x00)                                       /*  (TSENS_GAIN) Gain Register  Reset Value */

#define TSENS_GAIN_GAIN_Pos                   _UINT32_(0)                                          /* (TSENS_GAIN) Time Amplifier Gain Position */
#define TSENS_GAIN_GAIN_Msk                   (_UINT32_(0xFFFFFF) << TSENS_GAIN_GAIN_Pos)          /* (TSENS_GAIN) Time Amplifier Gain Mask */
#define TSENS_GAIN_GAIN(value)                (TSENS_GAIN_GAIN_Msk & (_UINT32_(value) << TSENS_GAIN_GAIN_Pos)) /* Assignment of value for GAIN in the TSENS_GAIN register */
#define TSENS_GAIN_Msk                        _UINT32_(0x00FFFFFF)                                 /* (TSENS_GAIN) Register Mask  */


/* -------- TSENS_OFFSET : (TSENS Offset: 0x1C) (R/W 32) Offset Register -------- */
#define TSENS_OFFSET_RESETVALUE               _UINT32_(0x00)                                       /*  (TSENS_OFFSET) Offset Register  Reset Value */

#define TSENS_OFFSET_OFFSETC_Pos              _UINT32_(0)                                          /* (TSENS_OFFSET) Offset Correction Position */
#define TSENS_OFFSET_OFFSETC_Msk              (_UINT32_(0xFFFFFF) << TSENS_OFFSET_OFFSETC_Pos)     /* (TSENS_OFFSET) Offset Correction Mask */
#define TSENS_OFFSET_OFFSETC(value)           (TSENS_OFFSET_OFFSETC_Msk & (_UINT32_(value) << TSENS_OFFSET_OFFSETC_Pos)) /* Assignment of value for OFFSETC in the TSENS_OFFSET register */
#define TSENS_OFFSET_Msk                      _UINT32_(0x00FFFFFF)                                 /* (TSENS_OFFSET) Register Mask  */


/* -------- TSENS_CAL : (TSENS Offset: 0x20) (R/W 32) Calibration Register -------- */
#define TSENS_CAL_RESETVALUE                  _UINT32_(0x00)                                       /*  (TSENS_CAL) Calibration Register  Reset Value */

#define TSENS_CAL_FCAL_Pos                    _UINT32_(0)                                          /* (TSENS_CAL) Frequency Calibration Position */
#define TSENS_CAL_FCAL_Msk                    (_UINT32_(0x3F) << TSENS_CAL_FCAL_Pos)               /* (TSENS_CAL) Frequency Calibration Mask */
#define TSENS_CAL_FCAL(value)                 (TSENS_CAL_FCAL_Msk & (_UINT32_(value) << TSENS_CAL_FCAL_Pos)) /* Assignment of value for FCAL in the TSENS_CAL register */
#define TSENS_CAL_TCAL_Pos                    _UINT32_(8)                                          /* (TSENS_CAL) Temperature Calibration Position */
#define TSENS_CAL_TCAL_Msk                    (_UINT32_(0x3F) << TSENS_CAL_TCAL_Pos)               /* (TSENS_CAL) Temperature Calibration Mask */
#define TSENS_CAL_TCAL(value)                 (TSENS_CAL_TCAL_Msk & (_UINT32_(value) << TSENS_CAL_TCAL_Pos)) /* Assignment of value for TCAL in the TSENS_CAL register */
#define TSENS_CAL_Msk                         _UINT32_(0x00003F3F)                                 /* (TSENS_CAL) Register Mask  */


/* -------- TSENS_DBGCTRL : (TSENS Offset: 0x24) (R/W 8) Debug Control Register -------- */
#define TSENS_DBGCTRL_RESETVALUE              _UINT8_(0x00)                                        /*  (TSENS_DBGCTRL) Debug Control Register  Reset Value */

#define TSENS_DBGCTRL_DBGRUN_Pos              _UINT8_(0)                                           /* (TSENS_DBGCTRL) Debug Run Position */
#define TSENS_DBGCTRL_DBGRUN_Msk              (_UINT8_(0x1) << TSENS_DBGCTRL_DBGRUN_Pos)           /* (TSENS_DBGCTRL) Debug Run Mask */
#define TSENS_DBGCTRL_DBGRUN(value)           (TSENS_DBGCTRL_DBGRUN_Msk & (_UINT8_(value) << TSENS_DBGCTRL_DBGRUN_Pos)) /* Assignment of value for DBGRUN in the TSENS_DBGCTRL register */
#define TSENS_DBGCTRL_Msk                     _UINT8_(0x01)                                        /* (TSENS_DBGCTRL) Register Mask  */


